Autodesk.Revit.DB.WorksetKindFilter.WorksetKind
The WorksetKind.
Since:
2012

Autodesk.Revit.DB.WorksetKindFilter.#ctor(Autodesk.Revit.DB.WorksetKind,System.Boolean)
Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
worksetKind:
The WorksetKind to match.
inverted:
True if the filter should match all worksets which are not of the given WorksetKind.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WorksetKindFilter.#ctor(Autodesk.Revit.DB.WorksetKind)
Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind.
worksetKind:
The WorksetKind to match.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.WorksetKindFilter
A filter used to match worksets of the given WorksetKind.
Remarks:
This filter is a quick filter.
Since:
2012